Tekla.Structures.Model.RebarMesh.RebarMeshTypeEnum
The different types of reinforcement meshes.

Tekla.Structures.Model.RebarMesh.RebarMeshTypeEnum.UNKNOWN_MESH
The type of the mesh is unknown.

Tekla.Structures.Model.RebarMesh.RebarMeshTypeEnum.RECTANGULAR_MESH
The shape of the mesh is rectangular.

Tekla.Structures.Model.RebarMesh.RebarMeshTypeEnum.POLYGON_MESH
The shape of the mesh is a polygon. Create rectangular meshes also as polygon meshes.

Tekla.Structures.Model.RebarMesh.RebarMeshTypeEnum.BENT_MESH
The shape of the mesh is bent.